<template>
    <div class="agreement1 padding-top">
        <mt-header fixed title="怡禾健康用户协议">
            <a @click="$router.go(-1)" slot="left">
                <mt-button icon="back">返回</mt-button>
            </a>
        </mt-header>
        <div class="content agreementAb">  
            <div class="agreementCase">
                <div class="agreementText">
                    <h1>“怡禾健康”用户协议</h1>
                    <p class="blod">1.关于我们</p>
                    <p>
                        1.1 “怡禾健康”（下称“怡禾”或“平台”）由深圳怡禾健康管理有限公司负责运营。本协议中的“用户”与“您”指任何使用和/或访问本服务的个人或单位。
                    </p>
                    <p class="blod">2.协议目的</p>
                    <p>
                        2.1 本用户协议及怡禾发布的内容（以下合称“本协议”，包括但不限于怡禾现在或将来发布的声明、通知、公告、规则、解释、更新条款等）是怡禾为您提供本服务以及您使用和/或访问怡禾的依据。通过本协议，您将了解怡禾所提供的服务内容、您所享有的权利及使用规则等。<span class="blod"> 请您仔细阅读本协议，充分理解本协议各条款内容，若您使用和/或访问怡禾，则视为您完全接受本协议的全部条款，本协议即构成对双方均具有法律约束力的文件，若您不接受本协议，请勿使用和/或访问怡禾。</span>
                    </p>
                    <p class="blod">3.使用资格</p>
                    <p>
                        3.1 您需年满18周岁，方可访问并使用怡禾。若您未满18周岁，则需在您的父母或法定监护人监护之下方可使用怡禾。
                    </p>
                    <p class="blod">4.账户使用</p>
                    <p>
                        4.1 怡禾提供在线用户注册。<span class="blod"> 您的账号和密码由您自行保管，只要使用了您的账号和密码进行登录，无论是否本人，怡禾均认定为已得到您本人的授权，您应当对以您名下账号进行的所有活动承担全部法律责任。</span>若发现任何非法使用您的帐号或存在个人信息泄露的情况，请立即通知怡禾。<br/>
                        4.2 您应保证，您注册的个人信息应真实、准确和完整，若您的个人信息发生任何变动，应及时在平台上变更。因您个人原因提供任何错误、不实或不完整的个人信息的，将由您本人承担相应法律后果。<br/>
                        4.3 您注册的账户名称、头像和简介等信息不得出现任何违法和不良信息，否则怡禾有权采取合理的措施予以制止。<br/>
                    </p>
                    <p class="blod">5.本服务</p>
                    <p>
                        5.1 本协议所称“本服务”，系指用户通过怡禾获得的有偿在线咨询服务及医疗信息获取服务，怡禾提供服务的方式包括但不限于在线健康咨询、在线课程及会员服务等。<br/>
                        <span class="blod"> 5.2 怡禾所提供的服务未包含医疗问诊服务，如您坚持要求医生提供医疗问诊服务，医生有权拒绝回答您的相关咨询，怡禾有权拒绝为您提供服务，且无需对此承担任何责任。</span><br/>
                        <span class="blod"> 5.3 本服务所对应的收费虽由怡禾代收，但并非直接归属于怡禾，怡禾为本服务提供平台支持，收费标准由医生自行确定，怡禾仅收取服务费用的一定百分比作为居间费用。您应仔细阅读，若您使用和/或访问怡禾，则视为您对怡禾的法律定位予以认可，对医生收费标准予以接受，您应按医生的收费标准支付费用，若您对收费标准不予接受，请勿使用怡禾。</span><br/>
                        5.4 您有权根据自身情况选择不同的医生进行咨询，除本协议约定情形外，医生将在收到您咨询的问题后 24小时内回复，逾期未予回复的，怡禾将自动返还您的费用，但在您完成付款后，回复时限届满前，您无正当理由不得随意撤销咨询或要求返还费用。<br/>
                    </p>
                    <p class="blod">6.怡禾与用户之间的权利义务</p>
                    <p>
                        6.1 您向怡禾提供的信息应具真实性、准确性、完整性、合法性和有效性，您将对在怡禾提供的信息及言行承担全部法律责任。<br/>
                        6.2 您在怡禾上的言行不得违反相关法律规定、不得违反公序良俗、不得使用攻击性语言恶意中伤或侮辱诽谤他人。<br/>
                        6.3 您不得利用怡禾从事违法犯罪活动，不得以牟利的目的利用怡禾从事经营性活动。<br/>
                        6.4 您应在本协议约定的范围内提问，并且不得对与医疗健康无关的问题进行咨询或询问，否则医生有权拒绝回答，并无需承担任何法律责任。<br/>
                        6.5 您应根据本协议约定支付相关费用，未支付费用的，怡禾有权拒绝提供服务，并且无需承担任何法律责任。<br/>
                        6.6 怡禾不保证您对医生服务的满意度，但您对医生回复有不满意的，有权通过评价系统对医生进行评价反馈，怡禾将根据实际情况进行协调处理。<br/>
                        6.7 为保障您的良好体验，怡禾有义务维护平台的正常运行，亦有权利对平台不定期更新或升级，您予以理解并接受。<br/>
                        6.8 您未遵守本协议约定的，怡禾有独立判断的权利，并有权根据情况采取中断服务、停止服务、禁止用户账号使用、删除用户相关信息等合理措施，必要时有权对您的账户进行冻结。您涉嫌违法犯罪的，怡禾有权将您的情况移交相关部门依法处理，并不受本协议约定限制。<br/>
                    </p>
                    <p class="blod">7.隐私与安全</p>
                    <p>
                        7.1 适用范围<br/>
                        7.1.1 您根据怡禾要求提供的注册个人信息及账户信息；<br/>
                        7.1.2 您使用怡禾时提供的基本情况、病历资料、诊疗方案等文字、图片或数据信息；<br/>
                        7.1.3 您因使用怡禾提供的其他资料；<br/>
                        7.1.4 从合法公开披露的信息中，如从新闻报道、政府信息公开等渠道收集的用户信息，则排除在以上适用范围之外，怡禾可无需事先征得您的同意向外公开或披露。<br/>
                        7.2 隐私权保护<br/>
                        7.2.1 怡禾保证不对外公开或向其他第三方提供本条款规定的信息，除非：事先获得您的明确同意；根据有关法律法规的规定及相关公检法部门及政府主管部门的要求；为维护社会公众利益需要；<br/>
                        7.2.2 由于您将本人账号和密码提供给第三人导致的信息泄露，将由您自行承担相应法律后果；<br/>
                        7.2.3 因计算机病毒、网络攻击、网络侵入等导致的信息泄露，但怡禾已采取合理措施予以控制的，怡禾不承担因信息泄露导致的法律后果。<br/>
                        7.3 合理使用<br/>
                        7.3.1 在不向第三方透露您的保密信息的前提下，怡禾有权对所有用户数据信息进行分析和研究，以充分了解用户需求，提升服务质量。<br/>
                    </p>
                    <p class="blod">8.免责声明</p>
                    <p>
                        8.1 由于怡禾仅依据您提供的数据信息进行线上分析、判断，未进行线下的诊疗，<span class="blod"> 故怡禾上医生的回答仅作为健康咨询类建议供您参考，但不作为诊断、确诊和治疗依据，不能代替医生面诊的效力。您理解并同意接受，若您以此作为诊断和治疗依据，由此引发的任何负面影响、人身损害或经济损失均由您个人自行承担，您无权以任何形式向怡禾提出任何性质的索赔。</span><br/>
                        8.2 您在使用怡禾过程中提供的任何信息均应保证真实性、准确性、完整性及有效性，否则因您个人原因导致医生回答有误的，由您自行承担相应后果。<br/>
                        8.3 在任何情况下，怡禾均不能保证医生回答的科学性和正确性，由此可能引发的任何负面影响，怡禾予以免责。但怡禾将依据相关规定审核所提供服务的医生的执业资质、专业能力和经验，并且有相应的制度、规范及要求约束并考核医生，督促医生在提供专业、科学的服务。<br/>
                        8.4 怡禾因涉及互联网及移动通讯等服务，可能受各种不稳定因素的影响，比如台风、地震、洪水、停电等不可抗力、计算机病毒或黑客攻击等导致服务中断或不能满足用户需求的情形，您对此予以理解并同意接受，并自愿承担由此产生的法律风险。<br/>
                        8.5 如因怡禾自有系统发生故障影响平台的正常运行，怡禾将第一时间与相关部门联系并处理，您不得以此向怡禾索赔。同时，因系统维修或升级，怡禾有权暂停本服务，您予以理解并同意接受由此带来的影响。<br/>
                        8.6 因本条款规定的原因导致医生迟延回复用户咨询的，您予以理解并承诺不依据本协议相关规定追究怡禾的法律责任。<br/>
                    </p>
                    <p class="blod">9.知识产权条款</p>
                    <p>
                        9.1 怡禾因提供本服务所发布的任何文字、图片、视频、音频等，除法律的强制性规定外，未经怡禾书面许可，您不得以任何方式复制、转载、引用或实施其他侵犯怡禾知识产权的行为，怡禾保留要求您赔偿经济损失的权利。<br/>
                        9.2 您在怡禾上发表的言论或发布的信息均不得侵犯第三人的知识产权，否则由此造成的任何形式的法律纠纷，由您个人承担。<br/>
                        9.3 怡禾因您侵权而受到来自第三方的追索的，您应负责出面解决，若怡禾被法院或仲裁委员会等司法机构判决/裁决承担相应法律责任的，怡禾有权就此向您追偿。<br/>
                    </p>
                    <p class="blod">10.协议的修订</p>
                    <p>
                        10.1 根据国家法律法规变化及网络运营需要，怡禾有权对本协议条款不定期进行修订，并以公告的方式通知您，修订后的协议一经公告即时生效，并将替代原协议。您需留意修订的新协议，并确认是否同意新协议的内容。如您不同意更新后的协议，可以且应立即停止接受怡禾依据新协议提供的服务；如您继续使用怡禾提供的服务，即视为您同意更新后的协议。
                    </p>
                    <p class="blod">11.协议的解除和终止</p>
                    <p>
                        11.1 发生以下情形之一的，怡禾有权立即解除本协议，并终止对您提供的全部服务，由此造成的损失，您将自行承担：<br/>
                        11.1.1 您违反国家现行相关法律法规的规定或损害第三人合法权益的；<br/>
                        11.1.2 您因在使用本服务过程中的不当行为或违法行为，被司法机关或行政机构拘留或起诉的；<br/>
                        11.1.3 您提供的资料不真实的；<br/>
                        11.1.4 您利用怡禾发布不实言论，被第三人起诉的；<br/>
                        11.1.5 您盗用他人账户，实施违法犯罪活动或经营性活动的；<br/>
                        11.1.6 您违反本协议其他约定导致怡禾依约采取相应措施的。<br/>
                    </p>
                    <p class="blod">12.适用法律及管辖</p>
                    <p>
                        12.1 本协议签订于中华人民共和国广东省深圳市福田区。<br/>
                        12.2 本协议之效力、解释、履行、解除、终止和争议的解决均适用中华人民共和国现行有效的法律法规。如本协议与适用之法律相抵触的，则发生抵触之条款将按照法律规定重新解释，其它有效条款继续有效。<br/>
                        12.3 协议各方就本协议内容或其执行发生任何争议的，应尽力友好协商解决；协商不成的，任何一方可提交至本协议签订地有管辖权的人民法院诉讼解决。<br/>
                    </p>
                    <p class="blod">13.联系我们</p>
                    <p>
                        13.1 如对本协议内容或在使用怡禾过程中有任何疑问，请通过以下咨询电话联系怡禾：<br/>
                        0755-83661922。
                    </p>
                    <p class="blod textRight">深圳怡禾健康管理有限公司</p>

                </div>
            </div>          
        </div>
        
    </div>
</template>

<script>
export default {
}
</script>

<style lang="scss">
@import "~assets/sass/base.scss";

.agreement1 {
    position: fixed;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;
    background: #fff;
    z-index: 2000;
    .agreementAb {
        position: absolute;
        top: 42px;
        left: 0;
        right: 0;
        bottom: 0;
        background: #fff;
        overflow: auto;
        -webkit-overflow-scrolling: touch;
    }
    .agreementCase {
        background: #fff;
        .agreementText {
            padding: 10px;
            h1 {
                text-align: center;
                font-size: 17px;
                line-height: 36px;
            }
            p {
                font-size: 15px;
                line-height: 24px;
                color: $color-bfont;
                .blod {
                    font-size: 15px;
                    color: $color-afont;
                }
            }
            .blod{
                font-size: 16px;
                color: $color-afont;
                line-height: 26px;
                padding-top: 6px;
            }
            .textRight {
                text-align: right;
            }
        }
        .agreementHint {
            padding: 20px 0 0 0;
            display: flex;
            height: 40px;
            div {
                flex: 1;
                text-align: center;
                line-height: 40px;
                button {
                    width: 180px;
                    height: 40px;
                    font-size: $font-xl;
                }
            }
        }
    }
}

</style>