<template>
    <div class="agreementLogin">
        <mt-header fixed title="怡禾健康认证">
            <a @click="$router.go(-1)" slot="left">
                <mt-button icon="back">返回</mt-button>
            </a>
        </mt-header>
        <div class="content">  
            <div class="agreementCase">
                <div class="agreementText">
                    <h1>怡禾健康-医生及其他专业服务人员注册协议</h1>
                    <p>双方根据平等、自愿、协商一致的原则，就医生及其他专业服务人员在深圳市怡禾健康管理有限公司（以下简称“怡禾”）各平台注册及使用，根据《中华人民共和国民法通则》、《中华人民共和国合同法》等国家有关法律法规，本着平等、自愿、公平、诚信的精神，经充分协商一致后，自愿签订本协议，共同遵守本协议所列条款。</p>
                    <p class="blod">一、重要提示</p>
                    <p>
                        1、请医生及其他专业服务人员在使用怡禾开发或第三方合作的App、微信和网站等服务平台（以下简称“服务平台”）前务必审慎阅读、充分理解各条款内容。本注册协议包含了怡禾收集、存储、使用、共享和保护医生及其他专业服务人员的最终用户的个人信息的条款，以及怡禾开展各项服务、收益分配、知识产权、保密义务、违约责任等条款。<br/>
2、怡禾希望通过本注册协议向医生及其他专业服务人员清晰地介绍怡禾对医生及其他专业服务人员和医生及用户的服务方式，因此怡禾建议医生及其他专业服务人员完整地阅读本注册协议，以帮助医生及其他专业服务人员了解维护自己权利的方式。<br/>
3、怡禾有权根据服务内容、适用法律和政策的调整以及其他因素随时调整本注册协议。注册协议及平台服务规则的任何更新将以标注更新时间的方式公布在相关网页或相关微信群内。医生及其他专业服务人员如果继续服务平台，即视为医生及其他专业服务人员已接受本注册协议的任何条款。<br/>
                    </p>
                    <p class="blod">二、注册</p>
                    <p>
                        1、医生及其他专业服务人员在服务平台注册，需上传以下文件：<br/>
（1）医师执业证；<br/>
（2）医师职称证书（或工作证、医院聘书）；<br/>
（3）身份证；<br/>
（4）个人照；<br/>
（5）其他怡禾认为需要上传的文件（如当地法律认可的职业技能证书）<br/>
2、医生及其他专业服务人员一旦注册成功，应当保管账号及密码，不得将账号转让或借给他人使用。如发现账号非法使用或存在安全漏洞的情况，应当及时告知怡禾。<br/>
3、医生及其他专业服务人员在使用怡禾服务平台时，应当遵守怡禾发布的包括《怡禾健康咨询操作规范》、《怡禾通识》在内的规则和要求。<br/>

                    </p>
                    <p class="blod">三、信息保护</p>
                    <p>
                        1、当医生及其他专业服务人员使用本服务平台时，怡禾会要求医生及其他专业服务人员提供个人信息，包括但不限于：基本信息（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱、受教育程度、所属行业）；个人身份信息（包括身份证等）；网络身份标识信息（包括系统账号、IP地址、邮箱地址）；个人财产信息（交易和交易记录、以及余额、优惠券等虚拟财产信息）。<br/>
2、怡禾将采用行业内通行的、合理的标准来保护怡禾所储存的信息的安全性和保密性。尽管怡禾已经尽到合理努力，但医生及其他专业服务人员的信息仍有可能被盗、非法拥有或者滥用而给医生及其他专业服务人员带来人身、财产和声誉等方面损失的危险。医生及其他专业服务人员已了解上述风险并自愿承担。<br/>

                    </p>
                    <p class="blod">四、劳务报酬</p>
                    <p>
                        1、医生及其他专业服务人员可按平台规则自主设定咨询服务价格，每次在怡禾服务平台上回答用户提出的问题，可以获得相应的报酬。怡禾为运营推广相关服务做运营及市场措施时，比如推出怡禾会员等服务时，医生及其他专业服务人员应当比照普通用户给予平台设置的折扣。<br/>
2、医生及其他专业服务人员获得的报酬比例为用户支付给怡禾的费用的85%，即医生及其他专业服务人员与怡禾的分成比例为85%：15%。上述报酬均为含税报酬。<br/>
3、由于市场环境等因素的变化，怡禾可能会不时调整医生及其他专业服务人员的分成比例，比如根据医生及其他专业服务人员的服务质量调整分成比例，但应当提前不少于5个工作日通知医生及其他专业服务人员。如医生及其他专业服务人员不能接受分成比例的调整，可随时终止使用怡禾服务平台；如医生及其他专业服务人员继续使用怡禾服务平台，即视为接受该分成比例。<br/>
4、在中华人民共和国境内之工作所产生之税项，各方必须遵照中华人民共和国及各地政府所订之税例，自行承担税款。关于医生及其他专业服务人员的个人所得税，怡禾采取个人自行申报并缴纳税款的形式执行。怡禾有权随时根据税务部门的最新政策或意见，及时条款个人所得税税款的缴纳形式。<br/>

                    </p>
                    <p class="blod">五、支付方式</p>
                    <p>
                        1、报酬按T+7形式结算，医生及其他专业服务人员如对费用有疑虑，可于收到费用后一周内向怡禾提出，逾期未提出异议视为医生及其他专业服务人员已全部认可，并不得再提出任何异议。<br/>
3、如医生及其他专业服务人员在约定期限内对报酬提出异议，怡禾应对异议金额进行再次核算，如双方异议金额未超过应支付金额的5%的，以怡禾的报酬为准，若双方异议金额超过应支付金额的5%的，双方协商聘请有资质的第三方对应支付的报酬进行核算。<br/>
4、如医生及其他专业服务人员变更收款账户信息，应及时在服务平台进行变更。如因医生及其他专业服务人员未及时变更导致怡禾无法按时支付报酬的，怡禾不承担违约责任。<br/>

                    </p>
                    <p class="blod">六、医生及其他专业服务人员的权利和义务</p>
                    <p>
                        1、医生及其他专业服务人员应当具备相应的资质及条件，有能力开展健康咨询、指导建议及健康知识传播等服务。<br/>
2、医生及其他专业服务人员有义务每天在可以分配的时间内在怡禾服务平台上提供服务。<br/>
3、医生及其他专业服务人员有权就在服务平台提供服务获得相应报酬。<br/>
4、医生及其他专业服务人员在服务平台中的言行需遵守国家法律、法规以及怡禾制定的咨询操作规范、通识，不违背社会公共利益或公共道德，不得损害他人的合法权益，不得泄露所服务用户隐私和与怡禾达成共识的所有信息，不违反本协议及服务平台的相关规定。如果因此产生任何法律后果的，医生及其他专业服务人员应以自己的名义独立承担法律责任，协议终止后也不应免除医生及其他专业服务人员对此条的相对应的责任。<br/>
5、医生及其他专业服务人员应保证遵守中华人民共和国的现行法律、法规，保证不传播违反法律或者公序良俗的内容，损害自身公众形象、直接或间接的影响甲方声誉。<br/>
6、医生及其他专业服务人员应保证其与怡禾签订本协议的行为不受其他协议的约束，若因此与第三方产生任何纠纷，一切法律责任由医生及其他专业服务人员自行承担。如给怡禾造成损失，医生及其他专业服务人员还应赔偿损失。<br/>
7、怡禾鼓励和欢迎医生及其他专业服务人员在怡禾平台踊跃投稿和发表自己的科普或专业方向热点短文章。<br/>
8、医生及其他专业服务人员同意并授权怡禾为本协议之目的（包括但不限于推广原创科普知识，推广医生及其他专业服务人员、作者等）无偿使用其肖像、个人简历、相关言论、作品、视频等。<br/>
9、如怡禾与第三方达成商务合作协议，怡禾可转授权第三方在商务合作协议记载的合作内容中，使用医生及其他专业服务人员的姓名、肖像、作品等内容，无需再次经过医生及其他专业服务人员同意。<br/>
10、本合同并不建立任何甲乙双方的劳动关系或者隶属关系，医生及其他专业服务人员不应因为本协议存在而影响本职工作。<br/>
12、医生及其他专业服务人员不得将本合同项下的权利或义务进行任何形式的转许可、转委托。<br/>
13、如医生及其他专业服务人员业务涉嫌违法，为配合法律调查，怡禾会将医生及其他专业服务人员在平台提供的内容和信息提供司法机构。<br/>
14、医生及其他专业服务人员承诺积极维护怡禾形象，不得做出有损怡禾形象或损坏怡禾利益的行为，医生及其他专业服务人员不得通过任何渠道（包括且不限于网站、博客、微博、微信、QQ聊天群、聚会等）发布不利于怡禾的言论，不得直接或间接唆使、引诱或鼓励任何怡禾员工、合作伙伴、用户、医生终止与怡禾或怡禾关联公司原有的合作关系。<br/>

                    </p>
                    <p class="blod">七、怡禾的权利和义务</p>
                    <p>
                        1、怡禾有义务在现有技术上维护服务平台的正常运行，并努力提升和改进技术，使医生及其他专业服务人员的服务得以顺利进行。<br/>
2、对医生及其他专业服务人员在使用服务中所遇到的与服务或注册相关问题及反映的情况，怡禾应及时做出回应。<br/>
3、因服务平台的特殊性，怡禾没有义务对医生及其他专业服务人员的服务行为以及与服务有关的其它事项进行事先审查，但如存在下列情况：<br/>
（1）第三方通知怡禾，认为医生及其他专业服务人员或医生及其他专业服务人员具体服务事项可能存在重大问题；<br/>
（2）医生及其他专业服务人员或第三方向怡禾告知服务平台上有违法或不当行为的；<br/>
（3）如果医生及其他专业服务人员明显违反怡禾制定的平台规则，怡禾有权根据情况选择删除相关信息或停止对医生及其他专业服务人员提供服务平台。<br/>
（4）怡禾以普通非专业人员的知识水平标准对相关内容进行判别，可以认为这些内容或行为具有违法或不当性质的，怡禾有权根据不同情况选择删除相关信息或停止对医生及其他专业服务人员提供服务平台，并追究相关法律责任。<br/>

                    </p>
                    <p class="blod">八、保密条款</p>
                    <p>
                        1、本协议任何一方对于本协议、任何补充协议所述内容及在合作过程知悉的对方的商业秘密、患者信息及其他保密信息负有保密义务。任何一方未经对方同意，均不得将该信息向任何第三方披露、传播、编辑或展示。<br/>
2、本协议约定的保密义务不因本协议的中止而解除，除非对方书面同意或者根据国家、行政、司法强制行为而披露的，或者该秘密已为公众所知悉的。<br/>
3、各方中的任意一方违反此保密条款，无论主观心态的故意与过失，均应当立即停止侵害，并及时采取一切必要措施防止保密资讯的扩散，尽最大可能帮助守约方消除影响。违约行为泄露守约方之保密资讯，给守约方造成损失的，违约方应全额赔偿守约方因此所遭受的直接经济损失以及守约方因调查违约方之违约行为而支付的合理费用（包括但不限于：调查费、交通费、人力成本、诉讼费及律师费）。<br/>

                    </p>
                    <p class="blod">九、免责条款</p>
                    <p>
                        1、不论在何种情况下，怡禾均不对由于Internet连接故障、电脑、手机、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。<br/>
2、怡禾不对医生及其他专业服务人员在怡禾平台上发表的言论或文章承担任何责任，如医生及其他专业服务人员发表的言论或文章侵犯第三人权利或造成第三人损失的，由医生及其他专业服务人员单独对此侵权行为承担赔偿责任。<br/>

                    </p>
                    <p class="blod">十、违约责任及解除协议</p>
                    <p>
                        1、任何一方不履行本协议部分或全部条款或者履行本协议部分或全部条款不符合约定的，应当对由此产生的后果负责，并向另一方承担赔偿相应损失等违约责任。<br/>
2、医生及其他专业服务人员承诺并认可，在线咨询或服务导致的纠纷、隐私权纠纷、名誉权纠纷等与怡禾无关。医生及其他专业服务人员应当在执业范围内合法合规提供服务，及时告知客户相应注意事项，否则，由此产生责任由医生及其他专业服务人员承担，且怡禾有权解除本协议、停用医生及其他专业服务人员账号。<br/>
3、经国家生效法律文书或行政处罚决定确认医生及其他专业服务人员存在违法行为，怡禾有权解除本协议、停用医生及其他专业服务人员账号。<br/>
4、除本协议及服务平台规则另有约定之外，如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失进行索赔，如违约方未能按时停止违约行为，则守约方有权立即终止本协议。<br/>
6、本协议无论因何种原因终止后，本协议保密、知识产权、抗辩、违约责任及其他依其性质应继续有效的条款应继续有效，并不损害受损方寻求其它救济的权利。<br/>

                    </p>
                    <p class="blod">十一、声明、承诺和保证</p>
                    <p>
                        1、医生及其他专业服务人员承诺，已向怡禾披露签署和履行本协议所应当向怡禾披露真实且完全的信息。<br/>
2、医生及其他专业服务人员均完全充分理解本协议的意思、权利义务的内容、违约解除的情形，对协议的签署意思表示真实并愿意承担约定的不利后果。<br/>
3、医生及其他专业服务人员声明和承诺本协议签署及履行不与第三方发生任何法律及商业上的冲突，如存在上述事由与第三方产生纠纷应自行处理并保证怡禾不受任何牵连及影响，如因上述事由致怡禾被第三方追讨、诉讼或声誉受损，愿意承担赔偿责任。<br/>

                    </p>
                    <p class="blod">十二、知识产权</p>
                    <p>
                        1、对于医生及其他专业服务人员通过服务平台所发布的任何公开信息，怡禾在全球范围内对上述公开信息享有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利。<br/>
2、医生及其他专业服务人员承诺，向怡禾提供的所有课程作品及其素材均系其原创或拥有完全知识产权，或已经合法取得相关著作权人、表演者及其他权利人的充分授权，或不超出著作权合理使用的范围，医生及其他专业服务人员拥有签署、履行本协议的一切必要许可、授权及权利。<br/>

                    </p>
                    <p class="blod">十三、数据保留</p>
                    <p>
                        1、服务发生变更、中断、终止后，怡禾有权保留医生及其他专业服务人员的注册数据及以前的行为记录（包括但不限于答复咨询内容、文章、视频、音频等）。
                    </p>
                    <p class="blod">十四、争议解决及其他</p>
                    <p>
                        1、因系统维护或升级的需要而需暂停服务，怡禾将尽量通过系统或者微信等渠道告知。<br/>
2、本协议的订立、生效、履行、解释、修改和终止等事项均适用中华人民共和国法律。<br/>
3、本协议双方如因履行本协议发生纠纷，应当友好协商解决，协商不成的，任何一方均可向怡禾所在地人民法院提起诉讼。<br/>
4、在争议发生和解决期间，除引起争议的事项外，本协议双方应继续善意行使各自在本协议项下未受影响的权利和履行未受影响的义务。<br/>
5、本协议任何一方未行使、部分行使或延迟行使其在本协议项下的任何权利，不应被认为其放弃该项权利或本协议项下的其他任何权利，但本协议一方明示以书面形式放弃其权利者除外。<br/>

                    </p>

                </div>
                <div class="agreementHint">
                    <router-link tag="div"  to="/authentication1"><mt-button type="primary">同意协议</mt-button></router-link>
                </div>
            </div>          
        </div>
        
    </div>
</template>

<script>
export default {
}
</script>

<style lang="scss">
@import "~assets/sass/base.scss";

.agreementLogin {
    // position: relative;
    .agreementCase {
        // position: absolute;
        // top: 42px;
        // left: 0%;
        // right: 0%;
        // bottom: 0%;
        background: #fff;
        padding: 0px 10px 50px;
        .agreementText {
            width: 100%;
            height: 100%;
            padding: 10px 0 0 0;
            overflow: auto;
            -webkit-overflow-scrolling: touch;
            h1 {
                text-align: center;
                font-size: 16px;
                line-height: 36px;
            }
            p {
                font-size: $font-l;
                line-height: 20px;
                color: $color-bfont
            }
            .blod{
                color: $color-afont;
                line-height: 24px;
                padding-top: 3px;
            }
        }
        .agreementHint {
            padding: 20px 0 0 0;
            display: flex;
            height: 40px;
            div {
                flex: 1;
                text-align: center;
                line-height: 40px;
                button {
                    width: 180px;
                    height: 40px;
                    font-size: $font-xl;
                }
            }
        }
    }
}

</style>